nxp-mcuxpresso/mcuxsdk-examples/_boards/twrmc56f8400/driver_examples/cadc/continuous_dma_conversion/pin_mux.h
/*
 * Copyright 2020-2021 NXP
 * All rights reserved.
 *
 * SPDX-License-Identifier: BSD-3-Clause
 */

/***********************************************************************************************************************
 * This file was generated by the MCUXpresso Config Tools. Any manual edits made to this file
 * will be overwritten if the respective MCUXpresso Config Tools is used to update this file.
 **********************************************************************************************************************/

#ifndef _PIN_MUX_H_
#define _PIN_MUX_H_

/*!
 * @addtogroup pin_mux
 * @{
 */

/***********************************************************************************************************************
 * API
 **********************************************************************************************************************/

#if defined(__cplusplus)
extern "C" {
#endif

/*!
 * @brief Calls initialization functions.
 *
 */
void BOARD_InitBootPins(void);

/*! @name GPIOA4 (number 21), J23[2]/J501[38]/J500A[A9]/J500B[C30]/ANA4
  @{ */
#define BOARD_THM0P_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THM0P_PIN 4U              /*!<@brief GPIOA pin index: 4 */
#define BOARD_THM0P_PIN_MASK kGPIO_Pin4 /*!<@brief PORT pin mask */
                                        /* @} */

/*! @name GPIOA5 (number 20), J23[4]/J501[40]/J500A[A10]/J500B[C29]/ANA5
  @{ */
#define BOARD_THM0N_GPIO GPIOA          /*!<@brief GPIO device name: GPIOA */
#define BOARD_THM0N_PIN 5U              /*!<@brief GPIOA pin index: 5 */
#define BOARD_THM0N_PIN_MASK kGPIO_Pin5 /*!<@brief PORT pin mask */
                                        /* @} */

/*!
 * @brief Configures pin routing and optionally pin electrical features.
 *
 */
void BOARD_InitPins(void);

#if defined(__cplusplus)
}
#endif

/*!
 * @}
 */
#endif /* _PIN_MUX_H_ */

/***********************************************************************************************************************
 * EOF
 **********************************************************************************************************************/
